docs/load-test/20260130-093215-none.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: infra/k6/scripts/allocation-status-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 2m30s max duration (incl. graceful stop):
              * load_test: Up to 2000 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<1000' p(95)=3.93s
    ✗ 'p(99)<5000' p(99)=8.26s

    http_req_failed
    ✓ 'rate<0.01' rate=0.02%


  █ TOTAL RESULTS 

    checks_total.......: 152782 1182.325344/s
    checks_succeeded...: 78.34% 119700 out of 152782
    checks_failed......: 21.65% 33082 out of 152782

    ✗ status is 200
      ↳  99% — ✓ 76373 / ✗ 18
    ✗ response time < 1000ms
      ↳  56% — ✓ 43327 / ✗ 33064

    HTTP
    http_req_duration..............: avg=1.35s min=8.48ms med=858.5ms max=1m0s   p(90)=2.92s p(95)=3.93s
      { expected_response:true }...: avg=1.34s min=8.48ms med=858.3ms max=57.25s p(90)=2.92s p(95)=3.92s
    http_req_failed................: 0.02%  18 out of 76391
    http_reqs......................: 76391  591.162672/s

    EXECUTION
    iteration_duration.............: avg=2.38s min=1s     med=1.88s   max=1m1s   p(90)=3.97s p(95)=5.01s
    iterations.....................: 76391  591.162672/s
    vus............................: 2      min=2           max=2000
    vus_max........................: 2000   min=2000        max=2000

    NETWORK
    data_received..................: 1.0 GB 7.8 MB/s
    data_sent......................: 8.4 MB 65 kB/s



time="2026-01-30T09:34:25+09:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"