docs/load-test/20260130-094713-none.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: infra/k6/scripts/allocation-status-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m30s max duration (incl. graceful stop):
              * load_test: Up to 1000 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<1000' p(95)=2.25s
    ✗ 'p(99)<5000' p(99)=17.99s

    http_req_failed
    ✓ 'rate<0.01' rate=0.74%


  █ TOTAL RESULTS 

    checks_total.......: 168136 1222.869578/s
    checks_succeeded...: 87.90% 147801 out of 168136
    checks_failed......: 12.09% 20335 out of 168136

    ✗ status is 200
      ↳  99% — ✓ 83442 / ✗ 626
    ✗ response time < 1000ms
      ↳  76% — ✓ 64359 / ✗ 19709

    HTTP
    http_req_duration..............: avg=1.09s    min=5.69ms   med=548.58ms max=1m0s   p(90)=1.48s p(95)=2.25s
      { expected_response:true }...: avg=852.91ms min=5.69ms   med=543.52ms max=45.41s p(90)=1.44s p(95)=2.01s
    http_req_failed................: 0.74%  626 out of 84068
    http_reqs......................: 84068  611.434789/s

    EXECUTION
    iteration_duration.............: avg=1.2s     min=105.96ms med=652.26ms max=1m0s   p(90)=1.58s p(95)=2.37s
    iterations.....................: 84066  611.420243/s
    vus............................: 1      min=1            max=1000
    vus_max........................: 1000   min=1000         max=1000

    NETWORK
    data_received..................: 1.1 GB 8.0 MB/s
    data_sent......................: 9.2 MB 67 kB/s



time="2026-01-30T09:49:31+09:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"